<a href="https://colab.research.google.com/github/moonjunseok/moon-python/blob/main/pandas%EB%9E%80%3F.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from collections import OrderedDict

In [ ]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [ ]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df = df[1:3]

In [ ]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.loc[[0,2]]

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

# by column condition

In [ ]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[(df.age>25)&(df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

#Filter Column

In [ ]:
# by index

friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [ ]:
df.iloc[:,0:2]  # : , 0:2  ->  row는 전부 다, column 은 0:2 까지만

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [ ]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [ ]:
# by column name

In [40]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate','Julia','Brian','Chris']),
          ('age', [20, 30, 30,40,45,25]),
          ('job', ['student', 'developer', 'teacher','dentist','manager','intern']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [5]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
#job이 필요없을 경우

df_filtered= df[['name','age']]

In [7]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [8]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [45]:
# column 이름에 a가 들어가는 것들만 보여줘

df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [10]:
# b로 끝나는 column을 보여줘

df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [15]:
friend_dict_list = [{'age': 15, 'job': 'student'},
         {'age': 25, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [16]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [17]:
df.drop(['John', 'Nate'])

       age        job
Jenny   30  developer

In [18]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [19]:
df.drop(['John', 'Nate'],inplace=True)
df

       age        job
Jenny   30  developer

In [20]:
df

       age        job
Jenny   30  developer

df drop row, column

In [35]:
friends = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Ben', 'age': 25, 'job': 'developer'},
         {'name': 'Jenny', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends, columns=['name','age','job'])

In [23]:
df

    name  age        job
0   Jone   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [24]:
# jone 이랑 jenny를 삭제시키려면
df.drop(df.index[[0,2]])

  name  age        job
1  Ben   25  developer

In [26]:
# 나이가 20살 이상인것만

df= df[df.age>20]

In [27]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [29]:
# column을 drop하는 방법

df= df.drop('age', axis=1)

In [30]:
df

    name        job
0   Jone    student
1    Ben  developer
2  Jenny    teacher

In [36]:
df.drop('age', axis=1, inplace = True)

In [37]:
df

    name        job
0   Jone    student
1    Ben  developer
2  Jenny    teacher

행,열 생성 및 수정하기

In [46]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

In [47]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [48]:
# salary라는 열 추가하기

df['salary']= 0
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [49]:
# student를 제외한 행에는 salary가 있다

import numpy as np

In [50]:
df['salary']= np.where(df['job'] != 'student','yes','no')

In [51]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [52]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [53]:
# 총점을 추가하기

df['total']= df['midterm']+ df['final']
df.head()

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [54]:
df['average']= df['total']/2
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [56]:
grades= []

for row in df['average']:
  if row >= 90:
    grades.append('A')
  elif row >= 80:
        grades.append('B')
  elif row >= 70:
        grades.append('C')
  else:
        grades.append('F')
        
df['grade'] = grades

In [57]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [58]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

#APPLY 적용

In [59]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [60]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [69]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [70]:
def extract_year(row):
  return row.split('-')[0]

In [71]:
df['year']=df['yyyy-mm-dd'].apply(extract_year)

In [72]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [65]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [66]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [67]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [68]:
# index 번호는 무시해라

df.append(df2,ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50